# DATAFRAME

2 D representaion of data
#dataset
#table format
#columns and rows

In [1]:
import pandas as pd

There are 3 methods to create dataframe
 1. nested list
 2. list of dictionary
 3. dictionary of list

# 1. nested list

A nested list is a list that contains other lists as elements.

In [2]:
lis=[['Anu',10,'BCA'],['Manu',12,"BCOM"],['Adhil',11,'BBA'],['Vinod',34,'BA']]
df=pd.DataFrame(lis)
df

       0   1     2
0    Anu  10   BCA
1   Manu  12  BCOM
2  Adhil  11   BBA
3  Vinod  34    BA

In [3]:
 print(df.ndim)
 print(df.size)
 print(df.shape)

2
12
(4, 3)

In [4]:
#column name
df=pd.DataFrame(lis,columns=['name','age','batch'])
df

    name  age batch
0    Anu   10   BCA
1   Manu   12  BCOM
2  Adhil   11   BBA
3  Vinod   34    BA

#  2)dictionary of list

A dictionary of lists is a data structure where each key in the dictionary maps to a list of values.

In [5]:
 dic={'Name':['Anu','Manu','Adhil','Vinod'],'rollno:':[10,12,11,34],'Batch':['BCA','bcom','bba','ba']}
 df=pd.DataFrame(dic)
 df

    Name  rollno: Batch
0    Anu       10   BCA
1   Manu       12  bcom
2  Adhil       11   bba
3  Vinod       34    ba

#  3)list of dictionary

A list of dictionaries is a structure where each element in a list is a dictionary

In [2]:
lis=[{'name':'Anu','rollno:':10,'batch':'BCA'},{'name':'Manu','rollno:':12,'batch':'BBA'},
 {'name':'Vinod','rollno:':34,'batch':'BA','age':10}]
df=pd.DataFrame(lis)
df

    name  rollno: batch   age
0    Anu       10   BCA   NaN
1   Manu       12   BBA   NaN
2  Vinod       34    BA  10.0

?  create a df: attributes:empid,empname,designation,salary
a)nested list
b)dict of list
c)list of dict

# add column

In [7]:
df['gender1']=['f','m','m']

In [8]:
df

    name  rollno: batch   age gender gender1
0    Anu       10   BCA   NaN      f       f
1   Manu       12   BBA   NaN      m       m
2  Vinod       34    BA  10.0      m       m

## add a column at a specific index position

df.insert(index position,columnname,[values])

In [9]:
df.insert(2,'place',['kkd','pkd','mlp'])

In [10]:
df

    name  rollno: place batch   age gender gender1
0    Anu       10   kkd   BCA   NaN      f       f
1   Manu       12   pkd   BBA   NaN      m       m
2  Vinod       34   mlp    BA  10.0      m       m

In [11]:
# head
df.head(2)

   name  rollno: place batch  age gender gender1
0   Anu       10   kkd   BCA  NaN      f       f
1  Manu       12   pkd   BBA  NaN      m       m

In [12]:
#tail
df.tail(2)

    name  rollno: place batch   age gender gender1
1   Manu       12   pkd   BBA   NaN      m       m
2  Vinod       34   mlp    BA  10.0      m       m

## .info()

The .info() method is used with a Pandas DataFrame to get a quick summary of the dataset.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     3 non-null      object
 1   rollno:  3 non-null      int64
 2   place    3 non-null      object
 3   batch    3 non-null      object
 4   age      1 non-null      float64
 5   gender   3 non-null      object
 6   gender1  3 non-null      object
dtypes: float64(1), int64(1), object(5)
memory usage: 300.0+ bytes

In [15]:
df1=df.copy()

In [16]:
df1

    name  rollno: place batch   age gender gender1
0    Anu       10   kkd   BCA   NaN      f       f
1   Manu       12   pkd   BBA   NaN      m       m
2  Vinod       34   mlp    BA  10.0      m       m

## columns

In [ ]:
name
Name
NAME
name 

df['name']!= df['name ']

The .columns attribute is used to get or set the column names of a Pandas DataFrame.

In [17]:
df.columns

Index(['name', 'rollno:', 'place', 'batch', 'gender'], dtype='object')

## access a specific column's elements

In [ ]:
df.colmnanm

df.iloc[0:4] rd index
df.loc[0:3] 3rd index

In [17]:
#1
df.name

0      Anu
1     Manu
2    Vinod
Name: name, dtype: object

In [18]:
#2
df['name']

0      Anu
1     Manu
2    Vinod
Name: name, dtype: object

In [20]:
#3
df[['name']]

    name
0    Anu
1   Manu
2  Vinod

In [21]:
#4
df[['name','gender']]

    name gender
0    Anu      f
1   Manu      m
2  Vinod      m

In [22]:
df[['name','gender']].tail(1)

    name gender
2  Vinod      m

In [23]:
df[['name','gender']].head(1)

  name gender
0  Anu      f

## .iloc

iloc stands for integer location. It is used to access rows and columns by their integer positions (i.e., index numbers), not by labels.

In [19]:
data = {
    'Name': ['Asha', 'Bala', 'Chitra'],
    'Age': [23, 25, 22],
    'City': ['Delhi', 'Mumbai', 'Chennai']
}

df = pd.DataFrame(data)
df

     Name  Age     City
0    Asha   23    Delhi
1    Bala   25   Mumbai
2  Chitra   22  Chennai

In [20]:
df['location']=['kkd','pkd','mlp']
df

     Name  Age     City location
0    Asha   23    Delhi      kkd
1    Bala   25   Mumbai      pkd
2  Chitra   22  Chennai      mlp

df.iloc[index]

In [26]:
#1. Access a row by index:
df.iloc[1]

Name          Bala
Age             25
City        Mumbai
location       pkd
Name: 1, dtype: object

 df.iloc[row index,column index]

In [21]:
df.iloc[1,1]

25

df.iloc[rowindex(start:end),columnindex(start:end)]

In [28]:
df.iloc[1,1:4]

Age             25
City        Mumbai
location       pkd
Name: 1, dtype: object

In [29]:
df.iloc[1:2,1:4]

   Age    City location
1   25  Mumbai      pkd

In [30]:
df.iloc[0:2]

   Name  Age    City location
0  Asha   23   Delhi      kkd
1  Bala   25  Mumbai      pkd

In [31]:
df.iloc[0:2,:]

   Name  Age    City location
0  Asha   23   Delhi      kkd
1  Bala   25  Mumbai      pkd

In [32]:
df.iloc[0:2,0:4]

   Name  Age    City location
0  Asha   23   Delhi      kkd
1  Bala   25  Mumbai      pkd

In [23]:
df.iloc[0:2][['Name','City']]

   Name    City
0  Asha   Delhi
1  Bala  Mumbai

In [24]:
df.iloc[:][['Name']].head(2)

   Name
0  Asha
1  Bala

In [35]:
df.iloc[:][['Name']].tail(2)

     Name
1    Bala
2  Chitra

## loc

loc stands for label-based location indexing. It is used to access rows and columns by their labels (names), not by integer positions.

In [25]:
data = {
    'Name': ['Asha', 'Bala', 'Chitra'],
    'Age': [23, 25, 22],
    'City': ['Delhi', 'Mumbai', 'Chennai']
}

df = pd.DataFrame(data, index=['a', 'b', 'c'])  # custom row labels
df

     Name  Age     City
a    Asha   23    Delhi
b    Bala   25   Mumbai
c  Chitra   22  Chennai

In [37]:
df.loc['a']

Name     Asha
Age        23
City    Delhi
Name: a, dtype: object

In [38]:
df.loc[['a','c']]

     Name  Age     City
a    Asha   23    Delhi
c  Chitra   22  Chennai

In [39]:
df.loc['b','City']

'Mumbai'

In [40]:
df.loc[df['Age']>22]

   Name  Age    City
a  Asha   23   Delhi
b  Bala   25  Mumbai

In [27]:
df.loc[(df['Age']>22) & (df["Name"]=="Asha")]

   Name  Age   City
a  Asha   23  Delhi

In [42]:
data = {
    'Name': ['Asha', 'Bala', 'Chitra'],
    'Age': [23, 25, 22],
    'City': ['Delhi', 'Mumbai', 'Chennai']
}

df = pd.DataFrame(data)  
df

     Name  Age     City
0    Asha   23    Delhi
1    Bala   25   Mumbai
2  Chitra   22  Chennai

In [43]:
df.loc[0:2]

     Name  Age     City
0    Asha   23    Delhi
1    Bala   25   Mumbai
2  Chitra   22  Chennai

In [44]:
df.loc[0:1,['Name', 'Age']]

   Name  Age
0  Asha   23
1  Bala   25

## file upload

In [45]:
df=pd.read_csv(r"D:\Softronics\4.pandas\pandas\Untitled Folder\customer")
df

     4000001  Kristina    Chung  55                       Pilot      india
0    4000002     Paige     Chen  74                     Teacher         uk
1    4000003    Sherri   Melton  34                 Firefighter         us
2    4000004  Gretchen     Hill  66  Computer hardware engineer      china
3    4000005     Karen  Puckett  74                      Lawyer     africa
4    4000006   Patrick     Song  42                Veterinarian  australia
..       ...       ...      ...  ..                         ...        ...
457  4000459  Gretchen  Francis  60                  Politician    ireland
458  4000460    Cheryl     Horn  40                Veterinarian    ireland
459  4000461    Audrey  Forrest  50                   Architect    ireland
460  4000462      Alan    Levin  43                Statistician    ireland
461  4000463     Wayne   Weiner  70                       Actor    ireland

[462 rows x 6 columns]

In [46]:
df1=pd.read_csv('customer')
df1

     4000001  Kristina    Chung  55                       Pilot      india
0    4000002     Paige     Chen  74                     Teacher         uk
1    4000003    Sherri   Melton  34                 Firefighter         us
2    4000004  Gretchen     Hill  66  Computer hardware engineer      china
3    4000005     Karen  Puckett  74                      Lawyer     africa
4    4000006   Patrick     Song  42                Veterinarian  australia
..       ...       ...      ...  ..                         ...        ...
457  4000459  Gretchen  Francis  60                  Politician    ireland
458  4000460    Cheryl     Horn  40                Veterinarian    ireland
459  4000461    Audrey  Forrest  50                   Architect    ireland
460  4000462      Alan    Levin  43                Statistician    ireland
461  4000463     Wayne   Weiner  70                       Actor    ireland

[462 rows x 6 columns]

In [47]:
df=pd.read_csv('customer',names=['Id','Firstname','Lastname','Age','Profession','Location'])
df

          Id Firstname Lastname  Age                  Profession Location
0    4000001  Kristina    Chung   55                       Pilot    india
1    4000002     Paige     Chen   74                     Teacher       uk
2    4000003    Sherri   Melton   34                 Firefighter       us
3    4000004  Gretchen     Hill   66  Computer hardware engineer    china
4    4000005     Karen  Puckett   74                      Lawyer   africa
..       ...       ...      ...  ...                         ...      ...
458  4000459  Gretchen  Francis   60                  Politician  ireland
459  4000460    Cheryl     Horn   40                Veterinarian  ireland
460  4000461    Audrey  Forrest   50                   Architect  ireland
461  4000462      Alan    Levin   43                Statistician  ireland
462  4000463     Wayne   Weiner   70                       Actor  ireland

[463 rows x 6 columns]

In [48]:
# Print the first 2 rows.
df.iloc[:2]

        Id Firstname Lastname  Age Profession Location
0  4000001  Kristina    Chung   55      Pilot    india
1  4000002     Paige     Chen   74    Teacher       uk

In [49]:
df.head(2)

        Id Firstname Lastname  Age Profession Location
0  4000001  Kristina    Chung   55      Pilot    india
1  4000002     Paige     Chen   74    Teacher       uk

In [50]:
# Display the first names and last names of the first 10 customers.

In [51]:
df.head(10)[['Firstname','Lastname']]

  Firstname    Lastname
0  Kristina       Chung
1     Paige        Chen
2    Sherri      Melton
3  Gretchen        Hill
4     Karen     Puckett
5   Patrick        Song
6     Elsie    Hamilton
7     Hazel      Bender
8   Malcolm      Wagner
9   Dolores  McLaughlin

In [52]:
df.iloc[0:11,1:3]

   Firstname    Lastname
0   Kristina       Chung
1      Paige        Chen
2     Sherri      Melton
3   Gretchen        Hill
4      Karen     Puckett
5    Patrick        Song
6      Elsie    Hamilton
7      Hazel      Bender
8    Malcolm      Wagner
9    Dolores  McLaughlin
10   Francis    McNamara

Display the first names and professions of all customers in the index range 100 to 200.

In [53]:
df.iloc[100:201][['Firstname','Profession']]

    Firstname                     Profession
100     Scott                        Teacher
101      Gene  Recreation and fitness worker
102    Louise                   Loan officer
103  Geoffrey                   Photographer
104  Patricia                   Veterinarian
..        ...                            ...
196     Terry  Recreation and fitness worker
197       Ken            Automotive mechanic
198      Judy                        Athlete
199     Clyde                     Pharmacist
200   Timothy                      Librarian

[101 rows x 2 columns]

## sort

sorting means arranging the rows of a DataFrame in a specific order
Sort the DataFrame in Ascending or Descending Order

In [54]:
df

          Id Firstname Lastname  Age                  Profession Location
0    4000001  Kristina    Chung   55                       Pilot    india
1    4000002     Paige     Chen   74                     Teacher       uk
2    4000003    Sherri   Melton   34                 Firefighter       us
3    4000004  Gretchen     Hill   66  Computer hardware engineer    china
4    4000005     Karen  Puckett   74                      Lawyer   africa
..       ...       ...      ...  ...                         ...      ...
458  4000459  Gretchen  Francis   60                  Politician  ireland
459  4000460    Cheryl     Horn   40                Veterinarian  ireland
460  4000461    Audrey  Forrest   50                   Architect  ireland
461  4000462      Alan    Levin   43                Statistician  ireland
462  4000463     Wayne   Weiner   70                       Actor  ireland

[463 rows x 6 columns]

# 1. Ascending Order (Default)
df.sort_values(by='columnname')
#2. Descending Order
df.sort_values(by='columnname', ascending=False)

In [55]:
#1.sort all customers based on their age in ascending order
df.sort_values(by='Age')

          Id Firstname   Lastname  Age           Profession   Location
175  4000176   Kristin  Alexander   21                Coach      china
289  4000290      Gail  Whitehead   21                Nurse  australia
348  4000349   Russell     Dalton   21       Civil engineer  australia
291  4000292     Donna       Rice   21        Social worker  australia
51   4000052   Shirley    Merritt   21             Reporter         uk
..       ...       ...        ...  ...                  ...        ...
258  4000259  Margaret    Burgess   74        Social worker     africa
241  4000242      Edna      Hoyle   74  Electrical engineer     africa
306  4000307     Karen   Clements   74               Farmer  australia
324  4000325      Ruth     Harmon   75               Artist  australia
88   4000089    Sherri     Sutton   75        Social worker         us

[463 rows x 6 columns]

In [56]:
#2.sort all customers based on their age in Descending order
df.sort_values(by='Age',ascending=False)

          Id Firstname   Lastname  Age     Profession   Location
88   4000089    Sherri     Sutton   75  Social worker         us
324  4000325      Ruth     Harmon   75         Artist  australia
391  4000392      Emma      Olson   74          Pilot    ireland
258  4000259  Margaret    Burgess   74  Social worker     africa
306  4000307     Karen   Clements   74         Farmer  australia
..       ...       ...        ...  ...            ...        ...
175  4000176   Kristin  Alexander   21          Coach      china
289  4000290      Gail  Whitehead   21          Nurse  australia
450  4000451   Russell       Hess   21      Architect    ireland
51   4000052   Shirley    Merritt   21       Reporter         uk
291  4000292     Donna       Rice   21  Social worker  australia

[463 rows x 6 columns]

In [57]:
#3.display the 10 customers with the minimum age
df.sort_values(by='Age').head(10)

          Id Firstname   Lastname  Age                  Profession   Location
175  4000176   Kristin  Alexander   21                       Coach      china
289  4000290      Gail  Whitehead   21                       Nurse  australia
348  4000349   Russell     Dalton   21              Civil engineer  australia
291  4000292     Donna       Rice   21               Social worker  australia
51   4000052   Shirley    Merritt   21                    Reporter         uk
450  4000451   Russell       Hess   21                   Architect    ireland
453  4000454  Virginia     Turner   22  Computer hardware engineer    ireland
151  4000152   Vincent    Goldman   22                 Electrician      china
53   4000054    Judith     Cooper   22                   Economist         uk
358  4000359      Leon     Bender   22                 Firefighter  australia

In [58]:
#4.display the first name and last name of the 5 youngest people
df.sort_values(by='Age').head(5)[['Firstname','Lastname']]

    Firstname   Lastname
175   Kristin  Alexander
289      Gail  Whitehead
348   Russell     Dalton
291     Donna       Rice
51    Shirley    Merritt

In [59]:
#5.display the profession of the 2 maximum-aged persons
df.sort_values(by='Age',ascending=False).head(2)[['Profession']]

        Profession
88   Social worker
324         Artist

In [60]:
df.sort_values(by='Age').tail(2)[['Profession']]

        Profession
324         Artist
88   Social worker

In [61]:
df.sort_values(by='Firstname',ascending=False)

          Id Firstname    Lastname  Age               Profession   Location
49   4000050   William       Jones   53             Photographer         uk
22   4000023    Wesley      Teague   42                Carpenter      india
246  4000247    Wesley     Shaffer   58                   Farmer     africa
252  4000253    Wesley       Moser   64                   Doctor     africa
293  4000294     Wendy      Cherry   70             Loan officer  australia
..       ...       ...         ...  ...                      ...        ...
20   4000021      Alex         May   39  Environmental scientist      india
232  4000233      Alex       Henry   67           Police officer     africa
422  4000423      Alan      O'Neal   59                    Pilot    ireland
461  4000462      Alan       Levin   43             Statistician    ireland
271  4000272      Adam  Washington   54      Electrical engineer     africa

[463 rows x 6 columns]

In [62]:
# Sort by multiple columns
df.sort_values(by=['Firstname','Age'])

          Id Firstname    Lastname  Age               Profession   Location
271  4000272      Adam  Washington   54      Electrical engineer     africa
461  4000462      Alan       Levin   43             Statistician    ireland
422  4000423      Alan      O'Neal   59                    Pilot    ireland
20   4000021      Alex         May   39  Environmental scientist      india
232  4000233      Alex       Henry   67           Police officer     africa
..       ...       ...         ...  ...                      ...        ...
293  4000294     Wendy      Cherry   70             Loan officer  australia
22   4000023    Wesley      Teague   42                Carpenter      india
246  4000247    Wesley     Shaffer   58                   Farmer     africa
252  4000253    Wesley       Moser   64                   Doctor     africa
49   4000050   William       Jones   53             Photographer         uk

[463 rows x 6 columns]

In [63]:
df.sort_values(by='Firstname')

          Id Firstname    Lastname  Age               Profession   Location
271  4000272      Adam  Washington   54      Electrical engineer     africa
461  4000462      Alan       Levin   43             Statistician    ireland
422  4000423      Alan      O'Neal   59                    Pilot    ireland
20   4000021      Alex         May   39  Environmental scientist      india
232  4000233      Alex       Henry   67           Police officer     africa
..       ...       ...         ...  ...                      ...        ...
293  4000294     Wendy      Cherry   70             Loan officer  australia
252  4000253    Wesley       Moser   64                   Doctor     africa
246  4000247    Wesley     Shaffer   58                   Farmer     africa
22   4000023    Wesley      Teague   42                Carpenter      india
49   4000050   William       Jones   53             Photographer         uk

[463 rows x 6 columns]

In [64]:
#ignore_index:-The original row index is dropped and replaced with a new 0-based index.
df.sort_values(by='Firstname',ignore_index=True)

          Id Firstname    Lastname  Age               Profession   Location
0    4000272      Adam  Washington   54      Electrical engineer     africa
1    4000462      Alan       Levin   43             Statistician    ireland
2    4000423      Alan      O'Neal   59                    Pilot    ireland
3    4000021      Alex         May   39  Environmental scientist      india
4    4000233      Alex       Henry   67           Police officer     africa
..       ...       ...         ...  ...                      ...        ...
458  4000294     Wendy      Cherry   70             Loan officer  australia
459  4000253    Wesley       Moser   64                   Doctor     africa
460  4000247    Wesley     Shaffer   58                   Farmer     africa
461  4000023    Wesley      Teague   42                Carpenter      india
462  4000050   William       Jones   53             Photographer         uk

[463 rows x 6 columns]

In [65]:
df

          Id Firstname Lastname  Age                  Profession Location
0    4000001  Kristina    Chung   55                       Pilot    india
1    4000002     Paige     Chen   74                     Teacher       uk
2    4000003    Sherri   Melton   34                 Firefighter       us
3    4000004  Gretchen     Hill   66  Computer hardware engineer    china
4    4000005     Karen  Puckett   74                      Lawyer   africa
..       ...       ...      ...  ...                         ...      ...
458  4000459  Gretchen  Francis   60                  Politician  ireland
459  4000460    Cheryl     Horn   40                Veterinarian  ireland
460  4000461    Audrey  Forrest   50                   Architect  ireland
461  4000462      Alan    Levin   43                Statistician  ireland
462  4000463     Wayne   Weiner   70                       Actor  ireland

[463 rows x 6 columns]

In [66]:
df1=df.sort_values(by='Age',ignore_index=True)
df1

          Id Firstname   Lastname  Age           Profession   Location
0    4000176   Kristin  Alexander   21                Coach      china
1    4000290      Gail  Whitehead   21                Nurse  australia
2    4000349   Russell     Dalton   21       Civil engineer  australia
3    4000292     Donna       Rice   21        Social worker  australia
4    4000052   Shirley    Merritt   21             Reporter         uk
..       ...       ...        ...  ...                  ...        ...
458  4000259  Margaret    Burgess   74        Social worker     africa
459  4000242      Edna      Hoyle   74  Electrical engineer     africa
460  4000307     Karen   Clements   74               Farmer  australia
461  4000325      Ruth     Harmon   75               Artist  australia
462  4000089    Sherri     Sutton   75        Social worker         us

[463 rows x 6 columns]

In [67]:
#This sorts the DataFrame directly and updates df without needing assignment 
df1.sort_values(by='Firstname',inplace=True)

In [68]:
df1

          Id Firstname    Lastname  Age               Profession   Location
257  4000272      Adam  Washington   54      Electrical engineer     africa
177  4000462      Alan       Levin   43             Statistician    ireland
310  4000423      Alan      O'Neal   59                    Pilot    ireland
381  4000233      Alex       Henry   67           Police officer     africa
149  4000021      Alex         May   39  Environmental scientist      india
..       ...       ...         ...  ...                      ...        ...
417  4000294     Wendy      Cherry   70             Loan officer  australia
171  4000023    Wesley      Teague   42                Carpenter      india
290  4000247    Wesley     Shaffer   58                   Farmer     africa
344  4000253    Wesley       Moser   64                   Doctor     africa
250  4000050   William       Jones   53             Photographer         uk

[463 rows x 6 columns]

#na_postion
#when sorting a DataFrame that contains NaN (missing) values, we can control the position of those NaNs using the na_position parameter in sort_values()

In [69]:
df.sort_values(by='Profession',na_position='first')

          Id  Firstname    Lastname  Age  Profession   Location
256  4000257     Monica      Dodson   58         NaN     africa
26   4000027     Marcia       Walsh   64  Accountant      india
277  4000278   Meredith      Bowles   62  Accountant     africa
334  4000335        Jim   Singleton   55  Accountant  australia
281  4000282     Ashley     Hendrix   50  Accountant     africa
..       ...        ...         ...  ...         ...        ...
11   4000012      Sandy      Raynor   26      Writer      india
9    4000010    Dolores  McLaughlin   60      Writer      india
167  4000168       Jose       Sykes   47      Writer      china
338  4000339      Kerry        Huff   38      Writer  australia
50   4000051  Frederick       Baker   52      Writer         uk

[463 rows x 6 columns]

In [70]:
df.sort_values(by='Profession',na_position='last')

          Id  Firstname    Lastname  Age  Profession   Location
26   4000027     Marcia       Walsh   64  Accountant      india
277  4000278   Meredith      Bowles   62  Accountant     africa
334  4000335        Jim   Singleton   55  Accountant  australia
281  4000282     Ashley     Hendrix   50  Accountant     africa
327  4000328       Jane    Barefoot   53  Accountant  australia
..       ...        ...         ...  ...         ...        ...
9    4000010    Dolores  McLaughlin   60      Writer      india
167  4000168       Jose       Sykes   47      Writer      china
338  4000339      Kerry        Huff   38      Writer  australia
50   4000051  Frederick       Baker   52      Writer         uk
256  4000257     Monica      Dodson   58         NaN     africa

[463 rows x 6 columns]

## unique()

find all the unique (distinct) values in a column

In [71]:
df['Location'].unique()

array(['india', 'uk', 'us', 'china', 'africa', 'australia', 'ireland'],
      dtype=object)

## nunique()

count the number of unique (distinct) values in a column

In [72]:
df['Location'].nunique()

7

## value_counts()

#Count the occurrences of each unique value in a column.
#By default, it returns the counts in descending order (highest to lowest).
#df['columnname'].value_counts()

In [73]:
df['Location'].value_counts()

Location
australia    104
africa        90
us            78
ireland       77
china         56
uk            37
india         21
Name: count, dtype: int64

## loc

loc
# for specific condition
# df.loc[df['columnname']==condition]
df.loc[(df['columnname']==condition1) & (df['columnname']==condition2)]

In [74]:
#1.display the customers from India
df_india=df.loc[df['Location']=='india']
df_india

         Id Firstname    Lastname  Age                   Profession Location
0   4000001  Kristina       Chung   55                        Pilot    india
7   4000008     Hazel      Bender   63                    Carpenter    india
8   4000009   Malcolm      Wagner   39                       Artist    india
9   4000010   Dolores  McLaughlin   60                       Writer    india
10  4000011   Francis    McNamara   47                    Therapist    india
11  4000012     Sandy      Raynor   26                       Writer    india
12  4000013    Marion        Moon   41                    Carpenter    india
13  4000014      Beth     Woodard   65                     Musician    india
14  4000015     Julia       Desai   49                     Musician    india
15  4000016    Jerome     Wallace   52                   Pharmacist    india
16  4000017      Neal    Lawrence   72  Computer support specialist    india
17  4000018      Jean     Griffin   45             Childcare worker    india
18  4000019  Kristine   Dougherty   63            Financial analyst    india
19  4000020   Crystal      Powers   67       Engineering technician    india
20  4000021      Alex         May   39      Environmental scientist    india
21  4000022      Eric      Steele   66                       Doctor    india
22  4000023    Wesley      Teague   42                    Carpenter    india
23  4000024  Franklin        Vick   28                       Dancer    india
24  4000025    Claire   Gallagher   42                     Musician    india
25  4000026    Marian     Solomon   27                       Lawyer    india
26  4000027    Marcia       Walsh   64                   Accountant    india

## reset_index()

used to reset the row index of a DataFrame.
# allows you to reset the index back to the default 0, 1, 2, ....
# df.reset_index()

In [75]:
df_india.reset_index(drop=False)

,index,Id,Firstname,Lastname,Age,Profession,Location
0,0,4000001,Kristina,Chung,55,Pilot,india
1,7,4000008,Hazel,Bender,63,Carpenter,india
2,8,4000009,Malcolm,Wagner,39,Artist,india
3,9,4000010,Dolores,McLaughlin,60,Writer,india
4,10,4000011,Francis,McNamara,47,Therapist,india
5,11,4000012,Sandy,Raynor,26,Writer,india
6,12,4000013,Marion,Moon,41,Carpenter,india
7,13,4000014,Beth,Woodard,65,Musician,india
8,14,4000015,Julia,Desai,49,Musician,india
9,15,4000016,Jerome,Wallace,52,Pharmacist,india
10,16,4000017,Neal,Lawrence,72,Computer support specialist,india
11,17,4000018,Jean,Griffin,45,Childcare worker,india
12,18,4000019,Kristine,Dougherty,63,Financial analyst,india
13,19,4000020,Crystal,Powers,67,Engineering technician,india
14,20,4000021,Alex,May,39,Environmental scientist,india
15,21,4000022,Eric,Steele,66,Doctor,india
16,22,4000023,Wesley,Teague,42,Carpenter,india
17,23,4000024,Franklin,Vick,28,Dancer,india
18,24,4000025,Claire,Gallagher,42,Musician,india
19,25,4000026,Marian,Solomon,27,Lawyer,india
20,26,4000027,Marcia,Walsh,64,Accountant,india

In [76]:
#To remove the old index completely
df_india.reset_index(drop=True,inplace=True)

In [77]:
#display the details of pilots
df['Profession'].value_counts()

Profession
Childcare worker                   17
Musician                           15
Photographer                       15
Loan officer                       14
Pilot                              13
Doctor                             13
Veterinarian                       13
Actor                              12
Computer support specialist        12
Politician                         11
Statistician                       11
Electrical engineer                11
Civil engineer                     11
Carpenter                          10
Lawyer                             10
Environmental scientist            10
Economist                          10
Social worker                      10
Human resources assistant          10
Nurse                               9
Designer                            9
Coach                               9
Recreation and fitness worker       9
Athlete                             9
Agricultural and food scientist     9
Engineering technician              9
Firefighter                         9
Accountant                          9
Dancer                              9
Architect                           8
Electrician                         8
Artist                              8
Therapist                           8
Librarian                           8
Pharmacist                          8
Farmer                              8
Reporter                            8
Physicist                           8
Secretary                           8
Police officer                      7
Computer software engineer          7
Computer hardware engineer          7
Chemist                             6
Judge                               6
Real estate agent                   6
Automotive mechanic                 6
Teacher                             5
Psychologist                        5
Writer                              5
Financial analyst                   4
Name: count, dtype: int64

In [78]:
df.loc[df['Profession']=='Pilot']

          Id  Firstname  Lastname  Age Profession   Location
0    4000001   Kristina     Chung   55      Pilot      india
6    4000007      Elsie  Hamilton   43      Pilot    ireland
228  4000229       Faye    Norman   64      Pilot     africa
229  4000230      Kathy     Burch   28      Pilot     africa
250  4000251     Jeremy     House   61      Pilot     africa
270  4000271      Alice     Nance   59      Pilot     africa
321  4000322  Geraldine    Jensen   50      Pilot  australia
335  4000336     Steven   Ballard   62      Pilot  australia
391  4000392       Emma     Olson   74      Pilot    ireland
402  4000403        Leo  Lassiter   65      Pilot    ireland
422  4000423       Alan    O'Neal   59      Pilot    ireland
424  4000425       Dean      Lutz   26      Pilot    ireland
439  4000440     Hannah  Langston   25      Pilot    ireland

In [79]:
#display the FirstName and LastName of people whose profession is "Dancer"
df.loc[df['Profession']=='Dancer'][['Firstname','Lastname']]

     Firstname  Lastname
23    Franklin      Vick
109       Kurt   Cassidy
115      Danny     Byrne
164     Ronnie    Atkins
274   Lawrence     Miles
356        Max  Robinson
389      Tracy     Cates
423  Christina    Morris
431      Paige    Henson

In [80]:
#find the first name and last name of the maximum aged person from the UK
df.loc[df['Location']=='uk'].sort_values(by='Age')[['Firstname','Lastname']]

    Firstname   Lastname
51    Shirley    Merritt
53     Judith     Cooper
31   Gretchen  Goldstein
34    Shelley      Weeks
39    Douglas       Ross
36      Elsie     Barton
62    Melinda    Proctor
45      Louis  Rosenthal
38      Erica       Hall
35  Priscilla  Wilkerson
60    Jessica       Rich
56     Glenda     Morgan
33     Jerome   Johnston
54   Gretchen     Holmes
57      Scott      Hoyle
28      Wayne   Connolly
59   Michelle       Rich
44       Lois     Joseph
41  Katherine     Bender
27     Dwight     Monroe
58        Pat      Allen
46  Christina     Bowden
29  Stephanie    Hawkins
50  Frederick      Baker
49    William      Jones
55        Don     Sharpe
47    Darlene     Barton
52      Jason      Cross
32        Tim      Watts
30       Neal  Middleton
42       Paul      Woods
40     Donald      Chung
61       Evan      Grant
43   Patricia     Mangum
48     Harvey  Underwood
37       Beth     Walton
1       Paige       Chen

In [81]:
#find the number of persons from China 
df2=df.loc[df['Location']=='china']

In [82]:
len(df.loc[df['Location']=='china'])

56

In [83]:
len(df2)

56

In [84]:
df2.shape

(56, 6)

In [85]:
df2.shape[0]

56

Both len() and .shape[0] are valid for counting rows.

In [86]:
#find the count of teachers from the UK 
len(df.loc[(df['Profession']=='Teacher')&(df['Location']=='uk')])

2

1.Find the number of persons from India.

2.Display the details of persons from the US.

3.Display the first name, last name, and age of all persons from China in ascending order of age.

4.Display the details of the oldest person from Ireland.

5.Display the profession of the youngest person from India.

6.Display the details of all persons whose age is greater than 70.

7.Display the first name and profession of persons whose age is greater than 50 and whose country is China.

8.Display the details of all persons whose profession is "Pilot".

9.Display the details of all teachers from the UK.

10.Display the first name and last name of all accountants from India.

11.Display the details of the two oldest musicians from India.

12.Check if there are any missing values in the dataset.

13.Display the first name, profession, and age of all teachers in decreasing order of age.

14.Display the first name of the oldest musician from India.

15.Display the first name of the youngest dancer from India.

In [90]:
#12.
len(df.loc[df['Profession'].isna()])

1

In [91]:
df

          Id Firstname Lastname  Age                  Profession Location
0    4000001  Kristina    Chung   55                       Pilot    india
1    4000002     Paige     Chen   74                     Teacher       uk
2    4000003    Sherri   Melton   34                 Firefighter       us
3    4000004  Gretchen     Hill   66  Computer hardware engineer    china
4    4000005     Karen  Puckett   74                      Lawyer   africa
..       ...       ...      ...  ...                         ...      ...
458  4000459  Gretchen  Francis   60                  Politician  ireland
459  4000460    Cheryl     Horn   40                Veterinarian  ireland
460  4000461    Audrey  Forrest   50                   Architect  ireland
461  4000462      Alan    Levin   43                Statistician  ireland
462  4000463     Wayne   Weiner   70                       Actor  ireland

[463 rows x 6 columns]

In [92]:
df1=df.copy()

In [93]:
df1

          Id Firstname Lastname  Age                  Profession Location
0    4000001  Kristina    Chung   55                       Pilot    india
1    4000002     Paige     Chen   74                     Teacher       uk
2    4000003    Sherri   Melton   34                 Firefighter       us
3    4000004  Gretchen     Hill   66  Computer hardware engineer    china
4    4000005     Karen  Puckett   74                      Lawyer   africa
..       ...       ...      ...  ...                         ...      ...
458  4000459  Gretchen  Francis   60                  Politician  ireland
459  4000460    Cheryl     Horn   40                Veterinarian  ireland
460  4000461    Audrey  Forrest   50                   Architect  ireland
461  4000462      Alan    Levin   43                Statistician  ireland
462  4000463     Wayne   Weiner   70                       Actor  ireland

[463 rows x 6 columns]

In [94]:
df1.columns

Index(['Id', 'Firstname', 'Lastname', 'Age', 'Profession', 'Location'], dtype='object')

In [96]:
df1.Location.value_counts()

Location
australia    104
africa        90
us            78
ireland       77
china         56
uk            37
india         21
Name: count, dtype: int64

In [97]:
df1.Location.unique()

array(['india', 'uk', 'us', 'china', 'africa', 'australia', 'ireland'],
      dtype=object)

In [98]:
df1['Location'].unique()

array(['india', 'uk', 'us', 'china', 'africa', 'australia', 'ireland'],
      dtype=object)

In [99]:
df2=df1.loc[df1['Location']=='india']
df2

         Id Firstname    Lastname  Age                   Profession Location
0   4000001  Kristina       Chung   55                        Pilot    india
7   4000008     Hazel      Bender   63                    Carpenter    india
8   4000009   Malcolm      Wagner   39                       Artist    india
9   4000010   Dolores  McLaughlin   60                       Writer    india
10  4000011   Francis    McNamara   47                    Therapist    india
11  4000012     Sandy      Raynor   26                       Writer    india
12  4000013    Marion        Moon   41                    Carpenter    india
13  4000014      Beth     Woodard   65                     Musician    india
14  4000015     Julia       Desai   49                     Musician    india
15  4000016    Jerome     Wallace   52                   Pharmacist    india
16  4000017      Neal    Lawrence   72  Computer support specialist    india
17  4000018      Jean     Griffin   45             Childcare worker    india
18  4000019  Kristine   Dougherty   63            Financial analyst    india
19  4000020   Crystal      Powers   67       Engineering technician    india
20  4000021      Alex         May   39      Environmental scientist    india
21  4000022      Eric      Steele   66                       Doctor    india
22  4000023    Wesley      Teague   42                    Carpenter    india
23  4000024  Franklin        Vick   28                       Dancer    india
24  4000025    Claire   Gallagher   42                     Musician    india
25  4000026    Marian     Solomon   27                       Lawyer    india
26  4000027    Marcia       Walsh   64                   Accountant    india

In [100]:
df2.reset_index()

,index,Id,Firstname,Lastname,Age,Profession,Location
0,0,4000001,Kristina,Chung,55,Pilot,india
1,7,4000008,Hazel,Bender,63,Carpenter,india
2,8,4000009,Malcolm,Wagner,39,Artist,india
3,9,4000010,Dolores,McLaughlin,60,Writer,india
4,10,4000011,Francis,McNamara,47,Therapist,india
5,11,4000012,Sandy,Raynor,26,Writer,india
6,12,4000013,Marion,Moon,41,Carpenter,india
7,13,4000014,Beth,Woodard,65,Musician,india
8,14,4000015,Julia,Desai,49,Musician,india
9,15,4000016,Jerome,Wallace,52,Pharmacist,india
10,16,4000017,Neal,Lawrence,72,Computer support specialist,india
11,17,4000018,Jean,Griffin,45,Childcare worker,india
12,18,4000019,Kristine,Dougherty,63,Financial analyst,india
13,19,4000020,Crystal,Powers,67,Engineering technician,india
14,20,4000021,Alex,May,39,Environmental scientist,india
15,21,4000022,Eric,Steele,66,Doctor,india
16,22,4000023,Wesley,Teague,42,Carpenter,india
17,23,4000024,Franklin,Vick,28,Dancer,india
18,24,4000025,Claire,Gallagher,42,Musician,india
19,25,4000026,Marian,Solomon,27,Lawyer,india
20,26,4000027,Marcia,Walsh,64,Accountant,india

In [101]:
df2.reset_index(drop=True)

         Id Firstname    Lastname  Age                   Profession Location
0   4000001  Kristina       Chung   55                        Pilot    india
1   4000008     Hazel      Bender   63                    Carpenter    india
2   4000009   Malcolm      Wagner   39                       Artist    india
3   4000010   Dolores  McLaughlin   60                       Writer    india
4   4000011   Francis    McNamara   47                    Therapist    india
5   4000012     Sandy      Raynor   26                       Writer    india
6   4000013    Marion        Moon   41                    Carpenter    india
7   4000014      Beth     Woodard   65                     Musician    india
8   4000015     Julia       Desai   49                     Musician    india
9   4000016    Jerome     Wallace   52                   Pharmacist    india
10  4000017      Neal    Lawrence   72  Computer support specialist    india
11  4000018      Jean     Griffin   45             Childcare worker    india
12  4000019  Kristine   Dougherty   63            Financial analyst    india
13  4000020   Crystal      Powers   67       Engineering technician    india
14  4000021      Alex         May   39      Environmental scientist    india
15  4000022      Eric      Steele   66                       Doctor    india
16  4000023    Wesley      Teague   42                    Carpenter    india
17  4000024  Franklin        Vick   28                       Dancer    india
18  4000025    Claire   Gallagher   42                     Musician    india
19  4000026    Marian     Solomon   27                       Lawyer    india
20  4000027    Marcia       Walsh   64                   Accountant    india

In [102]:
df2

         Id Firstname    Lastname  Age                   Profession Location
0   4000001  Kristina       Chung   55                        Pilot    india
7   4000008     Hazel      Bender   63                    Carpenter    india
8   4000009   Malcolm      Wagner   39                       Artist    india
9   4000010   Dolores  McLaughlin   60                       Writer    india
10  4000011   Francis    McNamara   47                    Therapist    india
11  4000012     Sandy      Raynor   26                       Writer    india
12  4000013    Marion        Moon   41                    Carpenter    india
13  4000014      Beth     Woodard   65                     Musician    india
14  4000015     Julia       Desai   49                     Musician    india
15  4000016    Jerome     Wallace   52                   Pharmacist    india
16  4000017      Neal    Lawrence   72  Computer support specialist    india
17  4000018      Jean     Griffin   45             Childcare worker    india
18  4000019  Kristine   Dougherty   63            Financial analyst    india
19  4000020   Crystal      Powers   67       Engineering technician    india
20  4000021      Alex         May   39      Environmental scientist    india
21  4000022      Eric      Steele   66                       Doctor    india
22  4000023    Wesley      Teague   42                    Carpenter    india
23  4000024  Franklin        Vick   28                       Dancer    india
24  4000025    Claire   Gallagher   42                     Musician    india
25  4000026    Marian     Solomon   27                       Lawyer    india
26  4000027    Marcia       Walsh   64                   Accountant    india

In [103]:
#df2.reset_index(drop=True,inplace=True)
df2=df2.reset_index(drop=True)

In [104]:
df2

         Id Firstname    Lastname  Age                   Profession Location
0   4000001  Kristina       Chung   55                        Pilot    india
1   4000008     Hazel      Bender   63                    Carpenter    india
2   4000009   Malcolm      Wagner   39                       Artist    india
3   4000010   Dolores  McLaughlin   60                       Writer    india
4   4000011   Francis    McNamara   47                    Therapist    india
5   4000012     Sandy      Raynor   26                       Writer    india
6   4000013    Marion        Moon   41                    Carpenter    india
7   4000014      Beth     Woodard   65                     Musician    india
8   4000015     Julia       Desai   49                     Musician    india
9   4000016    Jerome     Wallace   52                   Pharmacist    india
10  4000017      Neal    Lawrence   72  Computer support specialist    india
11  4000018      Jean     Griffin   45             Childcare worker    india
12  4000019  Kristine   Dougherty   63            Financial analyst    india
13  4000020   Crystal      Powers   67       Engineering technician    india
14  4000021      Alex         May   39      Environmental scientist    india
15  4000022      Eric      Steele   66                       Doctor    india
16  4000023    Wesley      Teague   42                    Carpenter    india
17  4000024  Franklin        Vick   28                       Dancer    india
18  4000025    Claire   Gallagher   42                     Musician    india
19  4000026    Marian     Solomon   27                       Lawyer    india
20  4000027    Marcia       Walsh   64                   Accountant    india

## drop_duplicates()

This removes duplicate rows across all columns

In [111]:
df1.duplicated().sum()

0

In [112]:
df1.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
458    False
459    False
460    False
461    False
462    False
Length: 463, dtype: bool

In [113]:
#1. Check all duplicate rows
df1[df1.duplicated()]

Empty DataFrame
Columns: [Id, Firstname, Lastname, Age, Profession, Location]
Index: []

In [115]:
#2. Check duplicates based on specific columns
df1[df1.duplicated(subset='Profession')]

          Id Firstname  Lastname  Age    Profession Location
6    4000007     Elsie  Hamilton   43         Pilot  ireland
11   4000012     Sandy    Raynor   26        Writer    india
12   4000013    Marion      Moon   41     Carpenter    india
14   4000015     Julia     Desai   49      Musician    india
22   4000023    Wesley    Teague   42     Carpenter    india
..       ...       ...       ...  ...           ...      ...
458  4000459  Gretchen   Francis   60    Politician  ireland
459  4000460    Cheryl      Horn   40  Veterinarian  ireland
460  4000461    Audrey   Forrest   50     Architect  ireland
461  4000462      Alan     Levin   43  Statistician  ireland
462  4000463     Wayne    Weiner   70         Actor  ireland

[412 rows x 6 columns]

In [106]:
#1. Drop duplicates from all columns
df3=df1.copy()
df3.drop_duplicates()

          Id Firstname Lastname  Age                  Profession Location
0    4000001  Kristina    Chung   55                       Pilot    india
1    4000002     Paige     Chen   74                     Teacher       uk
2    4000003    Sherri   Melton   34                 Firefighter       us
3    4000004  Gretchen     Hill   66  Computer hardware engineer    china
4    4000005     Karen  Puckett   74                      Lawyer   africa
..       ...       ...      ...  ...                         ...      ...
458  4000459  Gretchen  Francis   60                  Politician  ireland
459  4000460    Cheryl     Horn   40                Veterinarian  ireland
460  4000461    Audrey  Forrest   50                   Architect  ireland
461  4000462      Alan    Levin   43                Statistician  ireland
462  4000463     Wayne   Weiner   70                       Actor  ireland

[463 rows x 6 columns]

In [107]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 463 entries, 0 to 462
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          463 non-null    int64
 1   Firstname   463 non-null    object
 2   Lastname    463 non-null    object
 3   Age         463 non-null    int64
 4   Profession  462 non-null    object
 5   Location    463 non-null    object
dtypes: int64(2), object(4)
memory usage: 21.8+ KB

In [117]:
#2. Drop duplicates based on specific column(s)
df3.drop_duplicates(subset=['Profession','Age'],keep='first')

,Id,Firstname,Lastname,Age,Profession,Location
0,4000001,Kristina,Chung,55,Pilot,india
1,4000002,Paige,Chen,74,Teacher,uk
2,4000003,Sherri,Melton,34,Firefighter,us
3,4000004,Gretchen,Hill,66,Computer hardware engineer,china
4,4000005,Karen,Puckett,74,Lawyer,africa
5,4000006,Patrick,Song,42,Veterinarian,australia
7,4000008,Hazel,Bender,63,Carpenter,india
8,4000009,Malcolm,Wagner,39,Artist,india
9,4000010,Dolores,McLaughlin,60,Writer,india
10,4000011,Francis,McNamara,47,Therapist,india
13,4000014,Beth,Woodard,65,Musician,india
15,4000016,Jerome,Wallace,52,Pharmacist,india
16,4000017,Neal,Lawrence,72,Computer support specialist,india
17,4000018,Jean,Griffin,45,Childcare worker,india
18,4000019,Kristine,Dougherty,63,Financial analyst,india
19,4000020,Crystal,Powers,67,Engineering technician,india
20,4000021,Alex,May,39,Environmental scientist,india
21,4000022,Eric,Steele,66,Doctor,india
23,4000024,Franklin,Vick,28,Dancer,india
26,4000027,Marcia,Walsh,64,Accountant,india
27,4000028,Dwight,Monroe,45,Economist,uk
28,4000029,Wayne,Connolly,40,Real estate agent,uk
29,4000030,Stephanie,Hawkins,50,Human resources assistant,uk
30,4000031,Neal,Middleton,59,Civil engineer,uk
34,4000035,Shelley,Weeks,25,Reporter,uk
35,4000036,Priscilla,Wilkerson,35,Agricultural and food scientist,uk
38,4000039,Erica,Hall,33,Police officer,uk
39,4000040,Douglas,Ross,27,Secretary,uk
41,4000042,Katherine,Bender,44,Physicist,uk
46,4000047,Christina,Bowden,47,Computer software engineer,uk
49,4000050,William,Jones,53,Photographer,uk
55,4000056,Don,Sharpe,53,Social worker,uk
60,4000061,Jessica,Rich,37,Actor,uk
63,4000064,Calvin,Diaz,65,Athlete,us
69,4000070,Marianne,Branch,53,Judge,us
70,4000071,Natalie,Walton,24,Recreation and fitness worker,us
74,4000075,Calvin,Christensen,54,Architect,us
77,4000078,Sara,Lucas,44,Loan officer,us
80,4000081,Mike,Whitehead,26,Politician,us
85,4000086,Ethel,Rodgers,30,Librarian,us
86,4000087,Steve,Graves,73,Nurse,us
87,4000088,Alison,Scarborough,66,Designer,us
97,4000098,Keith,Chandler,25,Coach,us
106,4000107,Mary,Morse,70,Automotive mechanic,us
111,4000112,Charlene,Heath,26,Electrician,us
124,4000125,Roberta,Zhang,38,Statistician,us
137,4000138,Tamara,Hunt,25,Psychologist,us
140,4000141,Jeff,Kaplan,70,Chemist,china
172,4000173,Donna,Adkins,72,Electrical engineer,china
193,4000194,Heather,Butler,67,Farmer,china
256,4000257,Monica,Dodson,58,NaN,africa

In [ ]:
#ignore_index
#inplace

## drop a column

In [118]:
df3.drop(['Id'],axis=1)
# axis=1-->column
#axis=0 -->row

    Firstname Lastname  Age                  Profession Location
0    Kristina    Chung   55                       Pilot    india
1       Paige     Chen   74                     Teacher       uk
2      Sherri   Melton   34                 Firefighter       us
3    Gretchen     Hill   66  Computer hardware engineer    china
4       Karen  Puckett   74                      Lawyer   africa
..        ...      ...  ...                         ...      ...
458  Gretchen  Francis   60                  Politician  ireland
459    Cheryl     Horn   40                Veterinarian  ireland
460    Audrey  Forrest   50                   Architect  ireland
461      Alan    Levin   43                Statistician  ireland
462     Wayne   Weiner   70                       Actor  ireland

[463 rows x 5 columns]

In [119]:
df3

          Id Firstname Lastname  Age                  Profession Location
0    4000001  Kristina    Chung   55                       Pilot    india
1    4000002     Paige     Chen   74                     Teacher       uk
2    4000003    Sherri   Melton   34                 Firefighter       us
3    4000004  Gretchen     Hill   66  Computer hardware engineer    china
4    4000005     Karen  Puckett   74                      Lawyer   africa
..       ...       ...      ...  ...                         ...      ...
458  4000459  Gretchen  Francis   60                  Politician  ireland
459  4000460    Cheryl     Horn   40                Veterinarian  ireland
460  4000461    Audrey  Forrest   50                   Architect  ireland
461  4000462      Alan    Levin   43                Statistician  ireland
462  4000463     Wayne   Weiner   70                       Actor  ireland

[463 rows x 6 columns]